IdeaRS.OpenModel.WeldEvaluation
WeldEvaluation

IdeaRS.OpenModel.WeldEvaluation.MaxForceElement
Check is calculated in element with max force in weld (too conservative)

IdeaRS.OpenModel.WeldEvaluation.ForceResultant
Check is calculated as resultant of all forces in weld

IdeaRS.OpenModel.WeldEvaluation.ApplyPlasticWelds
Plasticity in welds is taken into account in AM